app/views/home/index.html.haml

        - @venues.each do |venue|
          %div{class: "tile #{ venue.vouchers_available > 4 ? "green" : (venue.vouchers_available == 1 ? "red" : "yellow")} #{( venue.vouchers_available == 0 ? "sold-out" : "" )} #{venue.offers.first.category.map{|c| c.name.parameterize }.join(" ")} #{venue.city.parameterize}"}
---
SELECT "categories".* FROM "categories" INNER JOIN "categories_offers" ON "categories"."id" = "categories_offers"."category_id" WHERE "categories_offers"."offer_id" = 1
SELECT "offers".* FROM "offers" LIMIT 9
SELECT "vouchers".* FROM "vouchers" LIMIT 9