app/views/offers/_form.html.haml

SELECT "venues".* FROM "venues"
---
      = f.label :venue
      = collection_select(:offer, :venue_id, Venue.all, :id, :name)
    .field