app/controllers/home_controller.rb

SELECT "offers".* FROM "offers" LIMIT 9
SELECT "venues".* FROM "venues"
---
  def index
    enqueue_mix_panel_event "Visits Home Page"

    @venues = Venue.with_display_offers.page(params[:page]).per_page(9)