app/controllers/offers_controller.rb

  def show
    @offer = Offer.find(params[:id])
---
SELECT "offers".* FROM "offers" WHERE "offers"."id" = $1 LIMIT 1  [["id", "2"]]

  def edit
    @offer = Offer.find(params[:id])
---
SELECT "offers".* FROM "offers" WHERE "offers"."id" = $1 LIMIT 1  [["id", "1"]]

  def create
    @offer = Offer.new(params[:offer])
    respond_to do |format|
      if @offer.save
---
INSERT INTO "offers" ("created_at", "details", "image_content_type", "image_file_name", "image_file_size", "image_updated_at", "min_diners", "name", "updated_at", "venue_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def update
    @offer = Offer.find(params[:id])

    respond_to do |format|
      if @offer.update_attributes(params[:offer])
---
SELECT "offers".* FROM "offers" WHERE "offers"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "offers" SET "image_file_name" = 'sunset_1_bg_111602.jpg', "image_content_type" = 'image/jpeg', "image_file_size" = 97611, "image_updated_at" = '2013-05-07 20:48:16.707620', "updated_at" = '2013-05-07 20:48:17.226818' WHERE "offers"."id" = 2