app/controllers/venues_controller.rb

SELECT "venues".* FROM "venues" WHERE "venues"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    # @v = Venue.find(params[:id])
    @offer = Venue.find(params[:id]).offers.first