app/controllers/users/omniauth_callbacks_controller.rb

INSERT INTO "users" ("admin", "created_at", "current_sign_in_at", "current_sign_in_ip", "email", "encrypted_password", "last_sign_in_at", "last_sign_in_ip", "name", "phone", "provider", "remember_created_at", "reset_password_sent_at", "reset_password_token", "sign_in_count", "uid", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17) RETURNING "id"
UPDATE "users" SET "last_sign_in_at" = '2013-05-21 19:37:36.704781', "current_sign_in_at" = '2013-05-21 19:37:36.704781', "last_sign_in_ip" = '68.119.102.65', "current_sign_in_ip" = '68.119.102.65', "sign_in_count" = 1, "updated_at" = '2013-05-21 19:37:36.706137' WHERE "users"."id" = 239
---
  def facebook
    if current_user.nil?
      @user = User.find_by_facebook_uid(request.env["omniauth.auth"].uid)
      if @user.nil?
        @user = User.create(name:request.env["omniauth.auth"].info.name,
          provider:request.env["omniauth.auth"].provider,
          email:request.env["omniauth.auth"].info.email,
          facebook_uid:request.env["omniauth.auth"].uid,
          password:Devise.friendly_token[0,20],
          facebook_secret:request.env["omniauth.auth"]["credentials"].secret,
          facebook_token:request.env["omniauth.auth"]["credentials"].token,
          has_facebook:true
        )
      end
      sign_in_and_redirect @user
    else
      current_user.facebook_secret = request.env["omniauth.auth"]["credentials"].secret
      current_user.facebook_token = request.env["omniauth.auth"]["credentials"].token
      current_user.has_facebook = true
      current_user.save

INSERT INTO "users" ("admin", "created_at", "current_sign_in_at", "current_sign_in_ip", "email", "encrypted_password", "last_sign_in_at", "last_sign_in_ip", "name", "phone", "provider", "remember_created_at", "reset_password_sent_at", "reset_password_token", "sign_in_count", "uid", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17) RETURNING "id"
UPDATE "users" SET "last_sign_in_at" = '2013-05-21 19:37:45.107663', "current_sign_in_at" = '2013-05-21 19:37:45.107663', "last_sign_in_ip" = '68.119.102.65', "current_sign_in_ip" = '68.119.102.65', "sign_in_count" = 1, "updated_at" = '2013-05-21 19:37:45.108578' WHERE "users"."id" = 240
---
  def twitter
    if current_user.nil?

      @user = User.find_by_twitter_uid(request.env["omniauth.auth"].uid)
      if @user.nil?
        @user = User.create(name:request.env["omniauth.auth"].info.name,
          provider:request.env["omniauth.auth"].provider,
          email:"#{request.env["omniauth.auth"].info.name.parameterize}@twitter.com",
          twitter_uid:request.env["omniauth.auth"].uid,
          password:Devise.friendly_token[0,20],
          twitter_secret:request.env["omniauth.auth"]["credentials"].secret,
          twitter_token:request.env["omniauth.auth"]["credentials"].token,
          has_twitter:true
        )
      end
      sign_in_and_redirect @user
    else
      current_user.twitter_secret = request.env["omniauth.auth"]["credentials"].secret
      current_user.twitter_token = request.env["omniauth.auth"]["credentials"].token
      current_user.has_twitter = true
      current_user.save